Tekla Open API Reference for Tekla Structures 2025
IFCExportFlags Fields
The Operation.IFCExportFlags type exposes the following members.
Fields
Name | Description
ExportRebarSetGroupAsIndividualBars
 Rebar set group individual bars export is enabled.
IsAssembliesEnabled
 Boolean indicating whether the assemblies export is enabled.
IsBoltsEnabled
 Boolean indicating whether the bolts export is enabled.
IsFlatBeamsAsPlates
 Export flat beams as plates.
IsGridsEnabled
 Boolean indicating whether the grids export is enabled.
IsLocationFromBuildingHierarchy
 Get locations from Building Hierarchy.
IsLocationFromOrganizer
 Get locations from organizer.
IsPoursEnabled
 Pours export is enabled. True for pours, false for CIP cast-units and/or parts
IsRebarsEnabled
 Boolean indicating whether the rebars export is enabled.
IsSpacesEnabled
 Boolean indicating whether the export of spaces in building hierarchy is enabled.
IsSurfaceTreatmentsAndSurfacesEnabled
 Boolean indicating whether the surfaces and surface treatments export is enabled.
IsWeldsEnabled
 Boolean indicating whether the welds export is enabled.
Top
See Also
Reference
Operation.IFCExportFlags Structure
Tekla.Structures.Model.Operations Namespace